microsoft/uf2-samdx1/lib/samd21/samd21a/atdf/ATSAMD21G18A.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42002800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA12"/>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="1" function="E" pad="PA13"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="21"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="27"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="TYPE" value="0"/>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.0.1">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41005000"/>
            <signals>
              <signal group="DM" function="G" pad="PA24"/>
              <signal group="DP" function="G" pad="PA25"/>
              <signal group="SOF_1KHZ" function="G" pad="PA23"/>
            </signals>
            <parameters>
              <param name="EPT_NBR" value="8"/>
              <param name="EPT_NUM" value="8"/>
              <param name="GCLK_ID" value="6"/>
              <param name="PIPE_NUM" value="8"/>
              <param name="INSTANCE_ID" value="37"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2203" version="2.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40001000"/>
            <parameters>
              <param name="GCLK_ID" value="3"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module><module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module><module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module></peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt_IRQn" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault_IRQn" index="-13" caption="Cortex-M0+ Hard Fault Interrupt"/>
        <interrupt name="SVCall_IRQn" index="-5" caption="Cortex-M0+ SV Call Interrupt"/>
        <interrupt name="PendSV_IRQn" index="-2" caption="Cortex-M0+ Pend SV Interrupt"/>
        <interrupt name="SysTick_IRQn" index="-1" caption="Cortex-M0+ System Tick Interrupt"/>
        <interrupt name="PM_IRQn" index="0" module-instance="PM"/>
        <interrupt name="SYSCTRL_IRQn" index="1" module-instance="SYSCTRL"/>
        <interrupt name="WDT_IRQn" index="2" module-instance="WDT"/>
        <interrupt name="RTC_IRQn" index="3" module-instance="RTC"/>
        <interrupt name="EIC_IRQn" index="4" module-instance="EIC"/>
        <interrupt name="NVMCTRL_IRQn" index="5" module-instance="NVMCTRL"/>
        <interrupt name="DMAC_IRQn" index="6" module-instance="DMAC"/>
        <interrupt name="USB_IRQn" index="7" module-instance="USB"/>
        <interrupt name="EVSYS_IRQn" index="8" module-instance="EVSYS"/>
        <interrupt name="SERCOM0_IRQn" index="9" module-instance="SERCOM0"/>
        <interrupt name="SERCOM1_IRQn" index="10" module-instance="SERCOM1"/>
        <interrupt name="SERCOM2_IRQn" index="11" module-instance="SERCOM2"/>
        <interrupt name="SERCOM3_IRQn" index="12" module-instance="SERCOM3"/>
        <interrupt name="SERCOM4_IRQn" index="13" module-instance="SERCOM4"/>
        <interrupt name="SERCOM5_IRQn" index="14" module-instance="SERCOM5"/>
        <interrupt name="TCC0_IRQn" index="15" module-instance="TCC0"/>
        <interrupt name="TCC1_IRQn" index="16" module-instance="TCC1"/>
        <interrupt name="TCC2_IRQn" index="17" module-instance="TCC2"/>
        <interrupt name="TC3_IRQn" index="18" module-instance="TC3"/>
        <interrupt name="TC4_IRQn" index="19" module-instance="TC4"/>
        <interrupt name="TC5_IRQn" index="20" module-instance="TC5"/>
        <interrupt name="ADC_IRQn" index="23" module-instance="ADC"/>
        <interrupt name="AC_IRQn" index="24" module-instance="AC"/>
        <interrupt name="DAC_IRQn" index="25" module-instance="DAC"/>
        <interrupt name="PTC_IRQn" index="26" module-instance="PTC"/>
        <interrupt name="I2S_IRQn" index="27" module-instance="I2S"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x10010305"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2205" version="1.1.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x4"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
